Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh11-v3.tmx
Source language: bo
Languages: en

source: རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་ཉམས་པ་མེད་པ་དང་། ལུས་ཀྱི་ལས་ཐམས་ཅད་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་ཞིང་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། ངག་གི་ལས་ཐམས་ཅད་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་ཞིང་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། ཡིད་ཀྱི་ལས་ཐམས་ཅད་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་ཞིང་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། འདས་པའི་དུས་ལ་མ་ཆགས་མ་ཐོགས་པའི་ཡེ་ཤེས་མཐོང་བ་འཇུག་པ་དང་། མ་འོངས་པའི་དུས་ལ་མ་ཆགས་མ་ཐོགས་པའི་ཡེ་ཤེས་མཐོང་བ་འཇུག་པ་དང་། ད་ལྟར་བྱུང་བའི་དུས་ལ་མ་ཆགས་མ་ཐོགས་པའི་ཡེ་ཤེས་མཐོང་བ་འཇུག་པ་སྟེ།
en: “If you ask what are the ‘eighteen distinct qualities of the buddhas,’ they are as follows: (1) The tathāgatas are without clumsiness; (2) they are not noisy; (3) they are without false memories; (4) they are without differentiating perceptions; (5) they are without uncomposed minds; (6) they are without the indifference that lacks discernment; (7) they do not degenerate in their resolution; (8) they do not degenerate in their perseverance; (9) they do not degenerate in their recollection; (10) they do not degenerate in their meditative stability; (11) they do not degenerate in their wisdom; (12) they do not degenerate in their liberation, nor in their perception of liberating gnosis; (13) all the activities of their bodies are preceded by gnosis and followed by gnosis; (14) all the activities of their speech are preceded by pristine cognition and followed by gnosis; (15) all the activities of their minds are preceded by gnosis and followed by gnosis; (16) they engage in the perception of gnosis which is unobstructed and unimpeded with respect to the past; (17) they engage in the perception of gnosis which is unobstructed and unimpeded with respect to the future; and (18) they engage in the perception of gnosis which is unobstructed and unimpeded with respect to the present.

source: དེ་དག་ནི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཅེས་བྱའོ། །
en: These are called the eighteen distinct qualities of the buddhas.

source: དེ་ལ་ཐམས་ཅད་ཤེས་པ་ཉིད་གང་ཞེ་ན། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་སྐྱེ་མཆེད་བཅུ་གཉིས་པོ་དག་ལ་གང་ཟག་ལ་བདག་མེད་པར་ཕྱོགས་གཅིག་ཤེས་པ་གང་ཡིན་པ་སྟེ།
en: “If you ask what is the ‘understanding of all phenomena,’ it is the partial understanding of selflessness with respect to personal identity that śrāvakas and pratyekabuddhas acquire with reference to the twelve sense fields.

source: དེ་ནི་ཐམས་ཅད་ཤེས་པ་ཉིད་ཅེས་བྱའོ། །
en: That is called the understanding of all phenomena.

source: དེ་ལ་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་གང་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་ཐེག་པ་གསུམ་གྱི་ལམ་ཤེས་ཀྱང་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པས་དགའ་བར་མི་སེམས་ཀྱི།
en: “If you ask what is the ‘understanding of the aspects of the path,’ it is the emancipation from cyclic existence that bodhisattvas acquire through the path of the bodhisattvas, inasmuch as they are not attracted by the vehicles of the śrāvakas and pratyekabuddhas, even though they understand the paths of all three vehicles.

source: བྱང་ཆུབ་སེམས་དཔའི་ལམ་གྱིས་ངེས་པར་འབྱུང་བ་གང་ཡིན་པ་སྟེ། དེ་ནི་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཅེས་བྱའོ། །
en: That is called the understanding of the aspects of the path.

source: དེ་ལ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་གང་ཞེ་ན། དེ་བཞིན་གཤེགས་པས་དུས་གསུམ་པོ་དག་ཏུ་རྣམ་པ་ཐམས་ཅད་དུ་ཆོས་ཐམས་ཅད་ལ་ཐེ་ཚོམ་མེད་པར་མཁྱེན་པ་གང་ཡིན་པ་སྟེ།
en: “If you ask what is the ‘understanding of omniscience,’ it is the knowledge that the tathāgatas have, without hesitation, with regard to all things, in all their aspects, throughout all the three times.

source: དེ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཅེས་བྱའོ། །
en: That is called omniscience.

source: དེ་ལ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་།
en: “If you ask what are the ‘six transcendent perfections,’ they comprise (1) the transcendent perfection of generosity, (2) the transcendent perfection of ethical discipline, (3) the transcendent perfection of tolerance, (4) the transcendent perfection of perseverance, (5) the transcendent perfection of meditative concentration, and (6) the transcendent perfection of wisdom.

source: བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ། དེ་དག་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཅེས་བྱའོ། །
en: These are called the six transcendent perfections.

source: དེ་ལ་མངོན་པར་ཤེས་པ་དྲུག་གང་ཞེ་ན། འདི་ལྟ་སྟེ། བྱ་བ་ཤེས་པ་མངོན་སུམ་དུ་བྱ་བ་ཤེས་པའི་མངོན་པར་ཤེས་པ་དང་། ལྷའི་མིག་ཤེས་པ་མངོན་སུམ་དུ་བྱ་བ་ཤེས་པའི་མངོན་པར་ཤེས་པ་དང་། ལྷའི་རྣ་བ་ཤེས་པ་མངོན་སུམ་དུ་བྱ་བ་ཤེས་པའི་མངོན་པར་ཤེས་པ་དང་། ཕ་རོལ་གྱི་སེམས་ཤེས་པ་མངོན་སུམ་དུ་བྱ་བ་ཤེས་པའི་མངོན་པར་ཤེས་པ་དང་། སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པ་ཤེས་པ་མངོན་སུམ་དུ་བྱ་བ་ཤེས་པའི་མངོན་པར་ཤེས་པ་དང་། ཟག་པ་ཟད་པ་ཤེས་པ་མངོན་སུམ་དུ་བྱ་བ་ཤེས་པའི་མངོན་པར་ཤེས་པ་སྟེ།
en: “If you ask what are the ‘six extrasensory powers,’ they comprise (1) the extrasensory power realizing knowledge of [miraculous] activities, (2) the extrasensory power realizing knowledge of divine clairvoyance, (3) the extrasensory power realizing knowledge of divine clairaudience, (4) the extrasensory power realizing knowledge of other minds, (5) the extrasensory power realizing knowledge of recollection of past lives, and (6) the extrasensory power realizing knowledge of the cessation of contaminants.

source: དེ་དག་ནི་མངོན་པར་ཤེས་པ་དྲུག་ཅེས་བྱའོ། །
en: These are called the six extrasensory powers.

source: དེ་ལ་མིག་ལྔ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཤའི་མིག་དང་། ལྷའི་མིག་དང་། ཤེས་རབ་ཀྱི་མིག་དང་། ཆོས་ཀྱི་མིག་དང་།
en: “If you ask what are the ‘five eyes,’ they comprise (1) the eye of flesh, (2) the eye of divine clairvoyance, (3) the eye of wisdom, (4) the eye of the sacred doctrine, and (5) the eye of the Buddha.

source: སངས་རྒྱས་ཀྱི་མིག་སྟེ། དེ་དག་ནི་མིག་ལྔ་ཞེས་བྱའོ། །
en: These are called the five eyes.

source: དེ་ལ་དེ་བཞིན་གཤེགས་པའི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་གང་ཞེ་ན། འདི་ལྟ་སྟེ། བཅོམ་ལྡན་འདས་ནི་ཞབས་ཤིན་ཏུ་གནས་པ་དང་ལྡན་པ་ཡིན་ནོ། །
en: “If you ask what are the ‘thirty-two major marks of a superior man that the tathāgatas possess,’ they are as follows: (1) The Blessed One has feet that are well positioned.

source: དེ་ལ་ཞབས་ཤིན་ཏུ་གནས་པ་ནི་འདི་ཡིན་ཏེ། ཞབས་ཀྱི་འོག་གི་མཐིལ་གཉིས་ཐམས་ཅད་ཀྱིས་ས་ལ་ཀུན་ཏུ་རེག་པ་སྟེ།
en: In this regard, ‘excellent positioning of the feet’ means that the soles of his two feet entirely touch the ground.

source: དཔེར་ན་ཟ་མ་ཏོག་གི་ཞབས་མཉམ་ཞིང་ཞབས་ཕྱང་ངེ་བ་ས་གཞི་ཤིན་ཏུ་མཉམ་པ་ལ་གཞག་ན། འོག་གི་ཞབས་ཐམས་ཅད་ཀྱིས་ས་ལ་ཀུན་ཏུ་རེག་པར་འགྱུར་བ་དེ་བཞིན་དུ། བཅོམ་ལྡན་འདས་ནི་ཞབས་ཤིན་ཏུ་གནས་པ་དང་ལྡན་པ་ཡིན་ནོ། །
en: Just as when the long, evenly balanced base of a basket is placed on level ground, the bottom of the base entirely touches the ground, in the same way, the Blessed One is endowed with feet that are well positioned.

source: བཅོམ་ལྡན་འདས་ནི་མུ་ཁྱུད་ཁོར་ཡུག་དང་ལྡན་པ་ཡིན་ནོ། །
en: (2) The Blessed One has feet that are marked with the motif of the wheel.

source: དེ་ལ་མུ་ཁྱུད་ཁོར་ཡུག་དང་ལྡན་པ་ནི་འདི་ཡིན་ཏེ། ཞབས་ཀྱི་འོག་གི་མཐིལ་གཉིས་ལ་འཁོར་ལོ་རྩིབས་སྟོང་དང་ལྡན་པ་ལྟེ་བ་དང་བཅས་པ་མུ་ཁྱུད་དང་བཅས་པ་རྣམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པ་མཛེས་པར་སྐྱེས་པ་གང་དག་ཡིན་པའོ། །
en: In this regard, the expression ‘marked with the motif of the wheel’ denotes the perfectly formed motif of a wheel with a thousand spokes, a hub, and a circumference, which elegantly appears on the soles of his two feet.

source: བཅོམ་ལྡན་འདས་ནི་ཕྱག་དང་ཞབས་འཇམ་ཞིང་གཞོན་ཤ་ཆགས་པ་ཡིན་ནོ། །
en: (3) The Blessed One has hands and feet that are tender and soft.

source: དེ་ལ་ཕྱག་དང་ཞབས་འཇམ་ཞིང་གཞོན་ཤ་ཆགས་པ་ཉིད་ནི་འདི་ཡིན་ཏེ་དཔེར་ན་ཤིང་བལ་གྱི་འདའ་བའམ། རས་བལ་གྱི་འདའ་བ་ལྟ་བུ་སྟེ། ཇི་ལྟར་མི་གཞན་དག་ལ་མེད་པ་ལྟ་བུ་ཡིན་ནོ། །
en: In this regard, ‘the tenderness and softness of his hands and feet’ means that, unlike those of human beings, they resemble tree cotton or shrub cotton.

source: བཅོམ་ལྡན་འདས་ནི་སོར་མོ་རིང་བ་ཡིན་ནོ། །
en: (4) The Blessed One has long toes and fingers.

source: དེ་ལ་སོར་མོ་རིང་བ་ཉིད་ནི་འདི་ཡིན་ཏེ། དེའི་ཕྱག་དང་ཞབས་ཀྱི་སོར་མོ་དག་ལྷག་པར་རིང་བ་སྟེ། ཇི་ལྟར་མི་གཞན་དག་ལ་མེད་པ་ལྟ་བུ་ཡིན་ནོ། །
en: In this regard, ‘long toes and fingers’ means that the fingers of his hands and the toes of his feet are exceedingly long, unlike those of other human beings.

source: བཅོམ་ལྡན་འདས་ནི་ཕྱག་དང་ཞབས་དྲ་བ་དང་ལྡན་པ་ཡིན་ཏེ།
en: (5) The Blessed One is endowed with hands and feet that are webbed.

source: དེའི་ཕྱག་དང་ཞབས་ལ་དྲ་བ་ལྷག་པ་དག་སྐྱེས་ཏེ། ཇི་ལྟར་མི་གཞན་དག་ལ་མེད་པ་ལྟ་བུ་ཡིན་ནོ། །
en: In fact, his hands and feet are prominently webbed, unlike those of other human beings.

source: བཅོམ་ལྡན་འདས་ནི་རྟིང་པ་ཡངས་པ་དང་ལྡན་པ་ཡིན་ནོ། །
en: (6) The Blessed One is endowed with broad heels.

source: དེ་ལ་རྟིང་པ་ཡངས་པ་ནི་འདི་ཡིན་ཏེ། དེའི་ཞབས་ཀྱི་རྟིང་པ་གཉིས་ཀྱི་མཐིལ་ནི་ཡངས་པ་སྟེ། ཇི་ལྟར་མི་གཞན་དག་ལ་མེད་པ་ལྟ་བུ་ཡིན་ནོ། །
en: In this regard, ‘broad heels’ means that the bases of his two heels are broad, unlike those of other human beings.

source: བཅོམ་ལྡན་འདས་ནི་ཞབས་ལོང་མོའི་ཚིགས་མི་མངོན་པ་ཡིན་ནོ།།དེ་ལ་ཞབས་ལོང་མོའི་ཚིགས་མི་མངོན་པ་ཉིད་ནི་འདི་ཡིན་ཏེ། རྟིང་པ་ཡངས་པ་ལ་ཡང་དག་པར་སྦྱོར་ལ། རྟིང་པ་ཡངས་པ་ཡང་ཞབས་ལོང་མོའི་ཚིགས་མི་མངོན་པ་ལ་སྦྱོར་བ་སྟེ། ཇི་ལྟར་མི་གཞན་དག་ལ་མེད་པ་ལྟ་བུ་ཡིན་ནོ། །
en: (7) The Blessed One is endowed with inconspicuous ankle bones, In this regard, ‘the inconspicuousness of his ankle bones’ means that, being endowed with broad heels, he is also endowed with inconspicuous ankle bones, unlike those of other human beings.

source: བཅོམ་ལྡན་འདས་ནི་བྱིན་པ་རི་དགས་ཨེ་ནྱ་ཡའི་ལྟ་བུ་དང་ལྡན་པ་ཡིན་ནོ། །
en: (8) The Blessed One is endowed with calves resembling those of an antelope.

source: དེ་ལ་བྱིན་པ་རི་དགས་ཨེ་ནྱ་ཡའི་ལྟ་བུ་ནི་འདི་ཡིན་ཏེ། དེའི་བྱིན་པ་བྱིན་གྱིས་ཕྲ་བར་སྐྱེས་ཤིང་། བྱིན་གྱིས་ཕྲ་བར་ཡང་དག་པར་བྱུང་བ་སྟེ། དཔེར་ན་རི་དགས་ཀྱི་རྒྱལ་པོ་ཨེ་ནྱ་ཡའི་ལྟ་བུ་ཡིན་ནོ། །
en: In this regard, ‘calves resembling those of an antelope’ means that his calves are slender and tapered, just like those of Śarabha Aiṇeya, the king of ungulates.

source: བཅོམ་ལྡན་འདས་ནི་བཞེངས་བཞིན་དུ་མ་བཏུད་པར་ཕྱག་པུས་མོར་སླེབ་པ་ཡིན་ནོ།།
en: (9) The Blessed One is endowed with arms that reach down to his knees when standing, without bending down.

source: དེ་ལ་བཞེངས་བཞིན་དུ་མ་བཏུད་པར་ཕྱག་པུས་མོ་ལ་སླེབ་པ་ནི་འདི་ཡིན་ཏེ། བཅོམ་ལྡན་འདས་ནི་བཞེངས་ན་སྐྲུ་མ་བཏུད་པར་ཕྱག་གི་མཐིལ་གཉིས་ཀྱིས་རང་གི་པུས་མོའི་ལྷ་ང་ལ་ཡང་དག་པར་རེག་པར་མཛད་ཅིང་ཀུན་ཏུ་ཉུག་པར་མཛད་པ་ཡིན་ནོ།།
en: In this regard, the expression ‘arms that reach down to his knees when standing, without bending down’ means that when the Blessed One is standing upright, the palms of both hands can touch and probe around his kneecaps, without him having to bend down.

source: བཅོམ་ལྡན་འདས་ནི་འདོམས་ཀྱི་སྦ་བ་སྦུབས་སུ་ནུབ་པ་ཡིན་ནོ། །
en: (10) The Blessed One is endowed with a contracted male organ.

source: དེ་ལ་འདོམས་ཀྱིསྦ་བ་སྦུབས་སུ་ནུབ་པ་ཉིད་ནི་འདི་ཡིན་ཏེ། དཔེར་ན་རིགས་བཙུན་པའི་གླང་པོ་ཆེ་ཅང་ཤེས་སམ། རྟ་ཅང་ཤེས་ཀྱི་ལྟ་བུ་ཡིན་ནོ། །
en: In this regard, the ‘contractedness of his male organ’ means that he resembles a thoroughbred elephant or a thoroughbred steed of noble breed.

source: བཅོམ་ལྡན་འདས་ནི་སྤུ་རེ་རེ་ནས་མཛེས་པར་སྐྱེས་ཤིང་གཡས་སུ་འཁྱིལ་པ་ཡིན་ནོ། །
en: (11) The Blessed One is endowed with hairs that grow finely and distinctly, curling to the right.

source: དེ་ལ་སྤུ་རེ་རེ་ནས་མཛེས་པར་སྐྱེ་ཤིང་གཡས་སུ་འཁྱིལ་པ་ཉིད་ནི་འདི་ཡིན་ཏེ། དེའི་སྤུའི་ཁུང་བུ་རེ་རེ་ནས་སྤུ་རེ་རེ་མཐོན་ཏིང་ལ་ལྕང་ལོར་འཁྱིལ་བ་འཇམ་ཞིང་སྣུམ་ལ་གཡས་སུ་འཁྱིལ་ཅིང་མཛེས་པར་སྐྱེས་པ་ཡིན་ནོ། །
en: In this regard, the expression ‘hairs that grow finely and distinctly, curling to the right’ means that from each of the pores of his skin a single hair finely grows, bluish black in color, curling softly into rings, lustrous and curling to the right.

source: བཅོམ་ལྡན་འདས་ནི་སྐུའི་སྤུ་གྱེན་དུ་ཕྱོགས་པ་དང་ལྡན་པ་ཡིན་ནོ། །
en: (12) The Blessed One is endowed with body hairs that point upwards.

source: དེ་ལ་སྐུའི་སྤུ་གྱེན་དུ་ཕྱོགས་པ་ཉིད་ནི་འདི་ཡིན་ཏེ། དེའི་སྐུ་དང་དབུ་ལས་སྐྱེས་པའི་དབུ་སྐྲ་དང་། སྤུ་རྣམས་ནི་ཁ་གྱེན་དུ་བལྟས་ཤིང་མཐོན་ཏིང་ལ་ཀུན་ནས་ལྕང་ལོར་འཁྱིལ་བ་འཇམ་ཞིང་སྣུམ་ལ་གཡས་སུ་འཁྱིལ་བ་མཛེས་པར་སྐྱེས་པ་ཡིན་ནོ། །
en: In this regard, the ‘pointing upwards of his body hairs’ means that the hair that grows from his head and the hairs of his body point upwards and finely grow, bluish black in color, all curling softly into rings, lustrous and curling to the right.

source: བཅོམ་ལྡན་འདས་ནི་པགས་པ་སྲབ་ཅིང་འཇམ་ལ་སྣུམ་པ་ཡིན་ནོ། །
en: (13) The Blessed One is endowed with delicate, soft, and lustrous skin.

source: དེ་ལ་པགས་པ་སྲབ་ཅིང་འཇམ་ལ་སྣུམ་པ་ནི་འདི་ཡིན་ཏེ། དེའི་སྐུ་ལ་ཆུའམ། རྡུལ་ཀུན་ཏུ་མི་འཆགས་ཤིང་མི་གནས་པ་ཡིན་ནོ། །
en: In this regard, the expression ‘delicate, soft, and lustrous skin’ means that neither water nor dust adhere to his body, or settle upon it.

source: བཅོམ་ལྡན་འདས་ནི་མདོག་གསེར་ལྟ་བུ་དང་ལྡན་ཏེ།
en: (14) The Blessed One is endowed with a golden complexion.

source: དཔེར་ན་འཛམ་བུ་ཆུ་བོའི་གསེར་གྱི་མཆོད་སྡོང་ལ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་སྤྲས་པ་ལྟར་གཟུགས་བཟང་ཞིང་མཛེས་ལ་བལྟ་ན་སྡུག་པ་ཡིན་ཏེ། དེས་ན་གསེར་གྱི་མདོག་ལྟ་བུ་ཞེས་བྱའོ། །
en: This means that his physical form is elegant, fine, and beautiful to behold, just like an offering post fashioned of finest gold that is adorned with various gemstones, for which reason it is said to resemble the color of gold.

source: བཅོམ་ལྡན་འདས་ནི་བདུན་མཐོ་བ་ཡིན་ནོ། །
en: (15) The Blessed One is endowed with seven prominent parts.

source: དེ་ལ་བདུན་མཐོ་བ་ཉིད་ནི་འདི་ཡིན་ཏེ་དེའི་ཞབས་གཉིས་ཀྱི་གོང་མཐོ་བ་གཉིས་གཟུགས་བཟང་ཞིང་མཛེས་ལ་བལྟ་ན་སྡུག་པ་ཤ་དང་ཁྲག་གིས་ཡོངས་སུ་རྒྱས་པར་གྱུར་པ་དང་།
en: In this regard, the expression ‘seven prominent parts’ means that the two prominent [backs of] his legs are elegant, fine, beautiful to behold, and filled out with flesh and blood.

source: དེ་བཞིན་དུ་ཕྱག་གཉིས་ཀྱི་མ་ཐོ་བ་གཉིས་གཟུགས་བཟང་ཞིང་མཛེས་ལ་བལྟ་ན་སྡུག་པ་ཤ་དང་ཁྲག་གིས་ཡོངས་སུ་རྒྱས་པར་གྱུར་པ་དང་།
en: Similarly, the two prominent [backs of] his arms are elegant, fine, beautiful to behold, and filled out with flesh and blood.

source: ཐལ་གོང་གཉིས་སུ་གཉིས་མཐོ་བར་གྱུར་པ་དང་། གཉའ་གོང་དུ་མཐོ་བ་གཅིག་གཟུགས་བཟང་ཞིང་མཛེས་ལ་བལྟ་ན་སྡུག་པ་ཤ་དང་ཁྲག་གིས་ཡོངས་སུ་རྒྱས་པར་གྱུར་པ་ཡིན་ནོ། །
en: There are also two prominent parts at his shoulders and one prominent part at the nape of his neck, which are elegant, fine, beautiful to behold, and filled out with flesh and blood.

source: བཅོམ་ལྡན་འདས་ནི་དཔུང་མགོ་ཤིན་ཏུ་ཟླུམ་པ་དང་ལྡན་པ་ཡིན་ནོ། །
en: (16) The Blessed One is endowed with amply curved shoulders.

source: བཅོམ་ལྡན་འདས་ནི་ཐལ་གོང་རྒྱས་པ་དང་ལྡན་པ་ཡིན་ནོ། །
en: (17) The Blessed One is endowed with collarbones that are well covered.

source: བཅོམ་ལྡན་འདས་ནི་སྐུ་ཤིན་ཏུ་དྲང་པོར་འཁྲུངས་པ་ཡིན་ནོ། །
en: (18) The Blessed One is born with an extremely upright posture.

source: བཅོམ་ལྡན་འདས་ནི་སྐུ་ནྱ་གྲོ་དྷ་ལྟར་ཆུ་ཞེང་གབ་པ་ཡིན་ནོ། །
en: (19) The Blessed One is endowed with a girth like the banyan tree.

source: དེ་ལ་ནྱ་གྲོ་དྷ་ལྟར་ཆུ་ཞེང་གབ་པ་ཉིད་ནི་འདི་ཡིན་ཏེ། ཆུར་ཇི་སྲིད་པ་ཞེང་དུ་ཡང་དེ་སྲིད་ལ་ཞེང་དུ་ཇི་སྲིད་པ་ཆུར་ཡང་དེ་སྲིད་དེ།
en: In that regard, the expression ‘endowed with a girth like the banyan tree’ means that the width of his body is proportionate to its length, and its length is proportionate to its width.

source: དེ་ནི་ནྱ་གྲོ་དྷ་ལྟར་ཆུ་ཞེང་གབ་པ་ཞེས་བྱའོ། །
en: That is designated as a ‘girth like the banyan tree.’

source: བཅོམ་ལྡན་འདས་ནི་འགྲམ་པ་སེང་གེའི་དང་འདྲ་བ་ཡིན་ནོ། །
en: (20) The Blessed One is endowed with lion-like cheeks.

source: བཅོམ་ལྡན་འདས་ནི་ཚེམས་བཞི་བཅུ་མངའ་བ་ཡིན་ནོ། །
en: (21) The Blessed One is endowed with forty teeth.

source: བཅོམ་ལྡན་འདས་ནི་ཚེམས་ཐགས་བཟང་བ་ཡིན་ནོ། །
en: (22) The Blessed One is endowed with close-fitting teeth.

source: བཅོམ་ལྡན་འདས་ནི་ཚེམས་རྩེ་མོ་མཐོ་ཞིང་རྣོ་ལ་དཀར་བ་ཡིན་ནོ། །
en: (23) The Blessed One is endowed with teeth whose tips are long, sharp, and white.

source: བཅོམ་ལྡན་འདས་ནི་རོ་བྲོ་བའི་མཆོག་དང་ལྡན་པ་ཡིན་ཏེ།
en: (24) The Blessed One is endowed with a superior organ of taste.

source: དེ་ནི་མགུར་དྲང་པོར་མིད་པ་དྲང་ཞིང་མི་ཡོ་ལ་ཐོགས་པ་མེད་པར་མིད་དུ་རུང་བར་གྱུར་པ་ཡིན་ནོ། །
en: This means that within his straight throat he has a gullet that is straight and not crooked, enabling him to swallow without hesitation.

source: བཅོམ་ལྡན་འདས་ནི་ལྗགས་རིང་ཞིང་སྲབ་པ་ཡིན་ནོ། །དེ་ལ་ལྗགས་རིང་ཞིང་སྲབ་པ་ཉིད་ནི་འདི་ཡིན་ཏེ།
en: (25) The Blessed One is endowed with a long and slender tongue.

source: དེ་བཞིན་གཤེགས་པ་བཞེད་ན་ཞལ་ནས་ལྗགས་ཕྱུང་སྟེ། ཤངས་ཀྱི་བུ་ག་གཉིས་དང་། སྤྱན་གྱི་ཁུང་བུ་གཉིས་དང་། སྙན་གྱི་བུ་ག་གཉིས་སུ་རེག་པར་མཛད་ཅིང་ཡོངས་སུ་ཉུག་པར་མཛད་ལ། དབུའི་མཚམས་སུ་ཐུག་པའི་ཞལ་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་ཀྱང་འགེབས་པར་མཛད་པ་ཡིན་ནོ། །
en: In this regard, the expression ‘long and slender tongue’ means that, when the Tathā­gata wishes, his tongue can protrude from his mouth, and is capable of touching and probing around his nostrils, eye sockets, and ears, and it can even cover his whole face, as far as the hairline.

source: བཅོམ་ལྡན་འདས་ནི་ཚངས་པའི་དབྱངས་དང་ལྡན་པ་ཡིན་ནོ། །
en: (26) The Blessed One is endowed with the divine voice of Brahmā.

source: བཅོམ་ལྡན་འདས་ནི་སྤྱན་ཡངས་ཤིང་བའི་རྫི་མ་ལྟ་བུ་ཡིན་ནོ། །
en: (27) The Blessed One is endowed with wide eyes and bovine eyelashes.

source: བཅོམ་ལྡན་འདས་ནི་སྤྱན་མཐོན་ཏིང་ལྟ་བུ་དང་ལྡན་པ་ཡིན་ནོ། །
en: (28) The Blessed One is endowed with deep blue eyes.

source: བཅོམ་ལྡན་འདས་ནི་སྤྱན་གྱི་ཚོགས་ཡོངས་སུ་རྫོགས་པ་ཡིན་ནོ། །
en: (29) The Blessed One is endowed with completely perfect eyeballs.

source: བཅོམ་ལྡན་འདས་ནི་འོད་འདོམ་གང་བ་ཡིན་ནོ། །
en: (30) The Blessed One is endowed with the splendor of an aureole of light, extending a full arm span.

source: བཅོམ་ལྡན་འདས་ནི་ཞལ་ཟླ་བ་ཉ་བ་ལྟ་བུ་ཡིན་ནོ། །
en: (31) The Blessed One is endowed with a visage that resembles the full moon.

source: བཅོམ་ལྡན་འདས་ནི་མཛོད་སྤུ་སྨིན་མཚམས་སུ་འཁྲུངས་ལ་ཤིང་བལ་ལྟར་འཇམ་ཞིང་མེ་ཏོག་ཀུན་ད་དང་། ཟླ་བ་དང་། དུང་དང་། པད་མའི་རྩ་ལག་དང་། བའི་འོ་མ་དང་།
en: (32) The Blessed One is endowed with a hair ringlet that grows between his eyebrows, and which is as soft as cotton, and white as a water lily, the moon, a conch, the filament of a lotus, the milk of a cow, and hoar-frost.

source: བ་མོའི་མདོག་ལྟ་བུ་དང་ལྡན་པ་ཡིན་ནོ། །བཅོམ་ལྡན་འདས་ནི་དབུ་གཙུག་ཏོར་དང་ལྡན་པ་ཡིན་ཏེ།
en: (33) The Blessed One is endowed with a crown extension.

source: དེ་དག་ནི་དེ་བཞིན་གཤེགས་པའི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཞེས་བྱའོ། །
en: These are called the thirty-two marks of a superior man that the tathāgatas possess.

source: དེ་ལ་དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་སེན་མོ་ཟངས་ཀྱི་མདོག་ལྟ་བུ་དང་ལྡན་པ་ཡིན་ནོ། །
en: “If you ask what are the ‘eighty minor marks,’ they are as follows: (1) The lord buddhas are endowed with copper-colored nails.

source: སྲེད་མེད་ཀྱི་བུའི་ལྟར་སྐུ་གྲིམས་པ་ཡིན་ནོ། །
en: (2) Their bodies are firm, like that of Nārāyaṇa.

source: པུས་མོའི་ལྷ་ང་དག་མཛེས་པར་གྱུར་པ་ཡིན་ནོ། །
en: (3) Their kneecaps are elegant.

source: སྐུ་གཙང་བ་དག་ཡིན་ནོ། །
en: (4) Their bodies are clean.

source: སྐུ་འཇམ་པ་དག་ཡིན་ནོ། །
en: (5) Their bodies are soft.

source: སྐུ་མཉེན་པ་དག་ཡིན་ནོ། །
en: (6) Their bodies are supple.

source: སྐུ་སྣུམ་བག་ཅན་དག་ཡིན་ནོ། །
en: (7) Their bodies are lustrous.

source: སྐུ་མ་བཏུད་པ་དག་ཡིན་ནོ། །
en: (8) Their bodies do not slouch.

source: སོར་མོ་རྣམས་རིང་བ་དང་བྱིན་གྱིས་ཕྲ་བ་དག་ཡིན་ནོ། །
en: (9) Their fingers and toes are compact.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་སོར་མོ་རྣམས་ཟླུམ་པ་དག་ཡིན་ནོ། །
en: (10) The lord buddhas have round fingers and toes.

source: སོར་མོ་རྣམས་བྱིན་གྱིས་ཕྲ་བདག་ཡིན་ནོ། །
en: (11) Their fingers and toes are tapering.

source: རྩ་རྣམས་མི་མངོན་པ་དག་ཡིན་ནོ། །
en: (12) Their blood vessels and nerves are inconspicuous.

source: ལོང་བུ་རྣམས་མི་མངོན་པ་དག་ཡིན་ནོ། །
en: (13) Their ankles are inconspicuous.

source: སྐུ་དབྱིབས་ལེགས་པ་དག་ཡིན་ནོ། །
en: (14) Their body is well formed.

source: སྐུ་ཤིན་ཏུ་ལེགས་པར་འབྲེལ་པ་དག་ཡིན་ནོ། །
en: (15) Their body is well proportioned.

source: སྐྱེ་མཆེད་རྣམས་ཤིན་ཏུ་ཡོངས་སུ་དག་པ་དག་ཡིན་ནོ། །
en: (16) Their senses are completely purified.

source: མཁྱེན་པ་ཡོངས་སུ་དག་པ་དག་ཡིན་ནོ། །
en: (17) Their understanding is perfectly pure.

source: སྤྱོད་ལམ་ཕུན་སུམ་ཚོགས་པ་དག་ཡིན་ནོ། །
en: (18) Their behavior is perfect.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་དཔལ་དང་བློ་གྲོས་དང་ལྡན་པ་དག་ཡིན་ནོ། །
en: (19) The lord buddhas are endowed with splendor and intelligence.

source: ལྟ་བར་འོས་པ་དག་ཡིན་ནོ། །
en: (20) They are worthy of beholding.

source: ཞལ་ཧ་ཅང་ཡང་མི་རིང་བ་དག་ཡིན་ནོ།།
en: (21) Their mouth is not too wide.

source: ཞལ་རྐང་རྐོང་མེད་པ་དག་ཡིན་ནོ།།
en: (22) Their mouth is without blemish.

source: སྒྲོས་པིམ་པ་ལྟར་དམར་བ་དག་ཡིན་ནོ།།
en: (23) Their lips are red like the balsam fruit.

source: ཞལ་ཡོངས་སུ་རྒྱས་པ་དག་ཡིན་ནོ། །
en: (24) Their mouth is compact.

source: དབྱངས་ཟབ་པ་དག་ཡིན་ནོ།།
en: (25) Their voice is deep [like the trumpet of an elephant or the rolling of thunder].

source: ལྟེ་བ་ཟབ་པ་དག་ཡིན་ནོ། །
en: (26) Their navel is deep.

source: ལྟེ་བ་ཤིན་ཏུ་ཟླུམ་པ་དག་ཡིན་ནོ། །
en: (27) Their navel is well rounded.

source: ལྟེ་བ་གཡས་སུ་འཁྱིལ་བ་དག་ཡིན་ནོ། །
en: (28) Their navel curls to the right.

source: ཕྱག་དང་ཞབས་ཡོངས་སུ་རྒྱས་པ་དག་ཡིན་ནོ། །
en: (29) Their arms and legs are compact.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ཕྱག་དང་ཞབས་ཇི་ལྟར་དགོངས་པ་བཞིན་དང་ལྡན་པ་དག་ཡིན་ནོ། །
en: (30) The lord buddhas are endowed with [well-proportioned] arms and legs, as intended.

source: ཕྱག་གི་མཐིལ་མཉམ་པ་དག་ཡིན་ནོ། །
en: (31) Their palms are even.

source: ཕྱག་གི་རི་མོ་བར་མ་ཆད་པ་དག་ཡིན་ནོ། །
en: (32) The lines of their palms are unbroken.

source: ཕྱག་གི་རི་མོ་མཐོ་བ་དག་ཡིན་ནོ། །
en: (33) The lines of their palms are extended.

source: སྐུ་ལ་དྲི་མ་མེད་ཅིང་དྲི་མི་ཞིམ་པ་མེད་པ་དག་ཡིན་ནོ། །
en: (34) Their body is immaculate and without unpleasant odors.

source: མདོག་གསལ་བ་དག་ཡིན་ནོ། །
en: (35) Their complexion is radiant.

source: སྐྱེ་མཆེད་ཀྱི་སྒོ་བཟང་བ་དག་ཡིན་ནོ།།
en: (36) Their [sense faculties]—the ‘gates to the sense fields’—are excellent.

source: ཞལ་ཟླ་བ་ལྟ་བུ་དག་ཡིན་ནོ། །
en: (37) Their face is moonlike.

source: གསོང་པོར་གསུང་བ་དག་ཡིན་ནོ། །
en: (38) They speak first.

source: ཞལ་ལ་ཁྲོ་གཉེར་གྱི་རིམ་པ་མེད་པ་དག་ཡིན་ནོ།།
en: (39) Their face is without frowns of anger.

source: སྤུའི་ཁུང་བུ་ཐམས་ཅད་ནས་དྲི་ཡིད་དུ་འོང་བ་འབྱུང་བ་དག་ཡིན་ནོ། །
en: (40) The pores of their body all emit a pleasant odor.

source: དེ་དག་གི་ཞལ་དྲི་ཞིམ་པ་དག་ཡིན་ནོ། །
en: (41) Their mouth is fragrant.

source: སེང་གེའི་སྟབས་སུ་གཤེགས་པ་དག་ཡིན་ནོ། །
en: (42) Their gait is that of a lion.

source: གླང་པོ་ཆེའི་དབང་པོའི་སྟབས་སུ་གཤེགས་པ་དག་ཡིན་ནོ། །
en: (43) Their gait is that of a mighty elephant.

source: ངང་པའི་སྟབས་སུ་གཤེགས་པ་དག་ཡིན་ནོ།།
en: (44) Their gait is that of a swan.

source: དབུ་གདུགས་འདྲ་བ་དག་ཡིན་ནོ།།
en: (45) Their head is [large], similar to a parasol.

source: གསུང་སྙན་ཅིང་རྣམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པ་དག་ཡིན་ནོ། །
en: (46) Their speech is sweet and fully perfected.

source: ཚེམས་མཆེ་བ་རྣོ་བ་དང་ལྡན་པ་དག་ཡིན་ནོ། །
en: (47) They are endowed with sharp eye-teeth.

source: ཤངས་མཐོ་བ་དག་ཡིན་ནོ། །
en: (48) Their nose is prominent.

source: ལྗགས་དམར་བ་དག་ཡིན་ནོ། །
en: (49) Their tongue is red.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ལྗགས་སྲབ་ཅིང་ཆེ་བ་དག་ཡིན་ནོ། །
en: (50) The lord buddhas have a tongue that is slender and large.

source: སྤུ་མཐོན་ཏིང་ཅན་དག་ཡིན་ནོ། །
en: (51) Their body hairs are bluish black.

source: སྤུ་གཙང་བ་དག་ཡིན་ནོ། །
en: (52) Their body hairs are clean.

source: སྤྱན་ཡངས་པ་དག་ཡིན་ནོ། །
en: (53) Their eyes are wide.

source: བུ་གའི་སྒོ་རྣམས་ཡོངས་སུ་མཉམས་པ་དག་ཡིན་ནོ། །
en: (54) Their orifices are without deterioration.

source: ཕྱག་དང་ཞབས་ཀྱི་མཐིལ་དམར་བ་དག་ཡིན་ནོ། །
en: (55) Their palms and soles are red.

source: ལྟེ་བ་མ་བྱེ་བ་དག་ཡིན་ནོ།།
en: (56) Their navel does not protrude.

source: དཀུ་མ་རྙོངས་པ་དག་ཡིན་ནོ།།
en: (57) Their abdomen is not misshapen.

source: ཕྱལ་ཕྱང་ངེ་བ་དག་ཡིན་ནོ།།
en: (58) Their abdomen is slender.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་སྐུ་ལ་གཉེར་མ་མེད་པ་དག་ཡིན་ནོ།།
en: (59) The lord buddhas have an abdomen that is unwrinkled.

source: ཚིགས་མཛེས་པ་དག་ཡིན་ནོ།།
en: (60) Their joints are elegant.

source: ཚིགས་རིང་བ་དག་ཡིན་ནོ། །
en: (61) Their joints are extended.

source: ཕྱག་དང་ཞབས་ཡོངས་སུ་དག་པ་དག་ཡིན་ནོ། །
en: (62) Their hands and feet are utterly pure.
